src/InformationRegisters/УведомленияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияПользователей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/УведомленияПользователей/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтоАдминистратор = РольДоступна("АдминистраторСистемы");

	Если ЭтоАдминистратор Тогда
		НастроитьРежимЖурналаУведомлений();
		Возврат;
	КонецЕсли;

	НастроитьРежимМоихУведомлений();

	ТекущийСотрудник =
		УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();

	Если ТекущийСотрудник = Неопределено Тогда
		Сообщить("Пользователь ИБ не связан с активным сотрудником.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ЭлементОтбора =
		Список.КомпоновщикНастроек.ФиксированныеНастройки
			.Отбор.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));

	ЭлементОтбора.ЛевоеЗначение =
		Новый ПолеКомпоновкиДанных("Получатель");

	ЭлементОтбора.ВидСравнения =
		ВидСравненияКомпоновкиДанных.Равно;

	ЭлементОтбора.ПравоеЗначение = ТекущийСотрудник;
	ЭлементОтбора.Использование = Истина;

КонецПроцедуры    

&НаСервере
Процедура НастроитьРежимЖурналаУведомлений()

	Заголовок = "Журнал уведомлений";

	Элементы.Получатель.Видимость = Истина;
	Элементы.ДатаПоказа.Видимость = Истина;
	Элементы.Обработано.Видимость = Истина;
	Элементы.ДатаОбработки.Видимость = Истина;

	Элементы.ФормаОтметитьПрочитанным.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура НастроитьРежимМоихУведомлений()

	Заголовок = "Мои уведомления";

	Элементы.Получатель.Видимость = Ложь;
	Элементы.ДатаПоказа.Видимость = Ложь;
	Элементы.Обработано.Видимость = Ложь;
	Элементы.ДатаОбработки.Видимость = Ложь;

	Элементы.ФормаОтметитьПрочитанным.Видимость = Истина;

КонецПроцедуры    

&НаКлиенте
Процедура ОтметитьПрочитанным(Команда)

	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;

	Если ТекущаяСтрока = Неопределено Тогда
		Сообщить("Выберите уведомление.");
		Возврат;
	КонецЕсли;

	УведомлениеПрочитано =
		УправлениеУведомлениямиВызовСервера
			.ОтметитьУведомлениеПрочитанным(
				ТекущаяСтрока.Период,
				ТекущаяСтрока.Заявка,
				ТекущаяСтрока.ТипУведомления);

	Если УведомлениеПрочитано Тогда
		Элементы.Список.Обновить();
	Иначе
		Сообщить("Не удалось отметить уведомление прочитанным.");
	КонецЕсли;

КонецПроцедуры
